In [6]:
import os
import csv

# Fungsi untuk membaca struktur tabel dari file CSV dan menghasilkan pernyataan SQL CREATE TABLE
def generate_sql_create_table(csv_file):
    # Membaca nama file tanpa ekstensi
    table_name = os.path.splitext(os.path.basename(csv_file))[0]
    
    # Membaca struktur tabel dari file CSV
    with open(csv_file, 'r', newline='', encoding='utf-8') as file:
        reader = csv.DictReader(file)
        # Menggunakan struktur kolom pertama dalam CSV sebagai referensi untuk struktur tabel
        columns = reader.fieldnames
        # Menginisialisasi tipe data kolom dengan VARCHAR sebagai default
        column_types = {column: 'VARCHAR(255)' for column in columns}
        # Memeriksa sampel data untuk menentukan tipe data kolom yang sesuai
        sample_data = next(reader)
        for column, data in sample_data.items():
            # Jika data dapat diubah menjadi integer tanpa desimal, itu adalah tipe data INTEGER
            try:
                int_data = int(data)
                if int_data == float(data):
                    column_types[column] = 'INTEGER'
            except ValueError:
                pass
            # Jika data dapat diubah menjadi float, itu adalah tipe data DECIMAL
            try:
                float_data = float(data)
                if '.' in data:
                    column_types[column] = 'DECIMAL(10, 2)'
            except ValueError:
                pass
    
    # Membuat pernyataan SQL CREATE TABLE
    sql_create_table = f"CREATE TABLE IF NOT EXISTS {table_name} (\n"
    for column, data_type in column_types.items():
        sql_create_table += f"    {column} {data_type},\n"
    # Menghapus koma ekstra di akhir
    sql_create_table = sql_create_table.rstrip(',\n')
    sql_create_table += "\n);\n"
    
    return sql_create_table

# Fungsi untuk membaca data dari file CSV dan menghasilkan pernyataan SQL INSERT
def generate_sql_insert_from_csv(csv_file):
    # Membaca nama file tanpa ekstensi
    table_name = os.path.splitext(os.path.basename(csv_file))[0]
    
    # Membaca data dari file CSV
    with open(csv_file, 'r', newline='', encoding='utf-8') as file:
        reader = csv.DictReader(file)
        rows = [row for row in reader]
    
    # Membuat pernyataan SQL INSERT
    sql_inserts = []
    for row in rows:
        columns = ', '.join(row.keys())
        values = ', '.join([f"'{value}'" for value in row.values()])
        sql_insert = f"INSERT INTO {table_name} ({columns}) VALUES ({values});"
        sql_inserts.append(sql_insert)
    
    return sql_inserts

# Fungsi untuk menulis pernyataan SQL ke file
def write_sql_to_file(sql_queries, output_file):
    with open(output_file, 'w') as file:
        for sql_query in sql_queries:
            file.write(sql_query + '\n')

# Folder tempat file CSV disimpan
csv_folder = 'csv'

# Membuat pernyataan SQL CREATE TABLE dan INSERT dari setiap file CSV di dalam folder
sql_queries = []
for file_name in os.listdir(csv_folder):
    if file_name.endswith('.csv'):
        file_path = os.path.join(csv_folder, file_name)
        sql_queries.append(generate_sql_create_table(file_path))
        sql_queries.extend(generate_sql_insert_from_csv(file_path))

# Menulis pernyataan SQL ke file
output_file = 'init.sql'
write_sql_to_file(sql_queries, output_file)

print(f"Pernyataan SQL telah ditulis ke '{output_file}'.")

Pernyataan SQL telah ditulis ke 'init.sql'.

In [12]:
import os
import csv

# Fungsi untuk membaca struktur tabel dari file CSV dan menghasilkan pernyataan SQL CREATE TABLE
def generate_sql_create_table(csv_file):
    # Membaca nama file tanpa ekstensi
    table_name = os.path.splitext(os.path.basename(csv_file))[0]
    
    # Membaca struktur tabel dari file CSV
    with open(csv_file, 'r', newline='', encoding='utf-8') as file:
        reader = csv.DictReader(file)
        # Menggunakan struktur kolom pertama dalam CSV sebagai referensi untuk struktur tabel
        columns = reader.fieldnames
        # Menginisialisasi tipe data kolom dengan VARCHAR sebagai default
        column_types = {column: 'VARCHAR(255)' for column in columns}
        # Memeriksa sampel data untuk menentukan tipe data kolom yang sesuai
        sample_data = next(reader)
        for column, data in sample_data.items():
            # Jika data dapat diubah menjadi integer tanpa desimal, itu adalah tipe data INTEGER
            try:
                int_data = int(data)
                if int_data == float(data):
                    column_types[column] = 'INTEGER'
            except ValueError:
                pass
            # Jika data dapat diubah menjadi float, itu adalah tipe data DECIMAL
            try:
                float_data = float(data)
                if '.' in data:
                    column_types[column] = 'DECIMAL(10, 2)'
            except ValueError:
                pass
    
    # Membuat pernyataan SQL CREATE TABLE
    sql_create_table = f"CREATE TABLE IF NOT EXISTS {table_name} (\n"
    for column, data_type in column_types.items():
        sql_create_table += f"    {column} {data_type},\n"
    # Menghapus koma ekstra di akhir
    sql_create_table = sql_create_table.rstrip(',\n')
    sql_create_table += "\n);\n"
    
    return sql_create_table

# Fungsi untuk menulis pernyataan SQL ke file
def write_sql_to_file(sql_queries, output_file):
    with open(output_file, 'w') as file:
        for sql_query in sql_queries:
            file.write(sql_query + '\n')

# Folder tempat file CSV disimpan
csv_folder = 'csv'

# Membuat pernyataan SQL CREATE TABLE dari setiap file CSV di dalam folder
sql_queries = []
for file_name in os.listdir(csv_folder):
    if file_name.endswith('.csv'):
        file_path = os.path.join(csv_folder, file_name)
        sql_queries.append(generate_sql_create_table(file_path))

# Menulis pernyataan SQL ke file
output_file = 'init.sql'
write_sql_to_file(sql_queries, output_file)

print(f"Pernyataan SQL CREATE TABLE telah ditulis ke '{output_file}'.")

Pernyataan SQL CREATE TABLE telah ditulis ke 'init.sql'.

In [13]:
import psycopg2
from psycopg2 import Error

# Fungsi untuk menjalankan file SQL
def execute_sql_file(file_path, conn):
    try:
        with conn.cursor() as cursor:
            with open(file_path, 'r') as sql_file:
                sql_commands = sql_file.read()
                cursor.execute(sql_commands)
                conn.commit()
                print(f"File SQL {file_path} berhasil dijalankan.")
    except Error as e:
        print(f"Error: {e}")
        conn.rollback()

# Fungsi untuk membuat koneksi ke database PostgreSQL
def create_connection(db_name, db_user, db_password, db_host, db_port):
    try:
        connection = psycopg2.connect(
            database=db_name,
            user=db_user,
            password=db_password,
            host=db_host,
            port=db_port
        )
        print("Koneksi ke PostgreSQL berhasil")
        return connection
    except Error as e:
        print(f"Error: {e}")
        return None

# Konfigurasi koneksi ke database
db_name = "db_dskola"
db_user = "postgres"
db_password = "12345678"
db_host = "localhost"
db_port = "5434"

# Path file SQL
sql_file_path = "init.sql"

# Membuat koneksi ke database
connection = create_connection(db_name, db_user, db_password, db_host, db_port)

if connection:
    # Menjalankan file SQL
    execute_sql_file(sql_file_path, connection)

    # Menutup koneksi database
    connection.close()

Koneksi ke PostgreSQL berhasil
File SQL init.sql berhasil dijalankan.

In [15]:
import os
import csv
import psycopg2
from psycopg2 import Error

# Fungsi untuk membaca struktur tabel dari file CSV dan menghasilkan pernyataan SQL CREATE TABLE
def generate_sql_create_table(csv_file):
    table_name = os.path.splitext(os.path.basename(csv_file))[0]
    
    with open(csv_file, 'r', newline='', encoding='utf-8') as file:
        reader = csv.DictReader(file)
        columns = reader.fieldnames
        column_types = {column: 'VARCHAR(255)' for column in columns}
        sample_data = next(reader)
        for column, data in sample_data.items():
            try:
                int_data = int(data)
                if int_data == float(data):
                    column_types[column] = 'INTEGER'
            except ValueError:
                pass
            try:
                float_data = float(data)
                if '.' in data:
                    column_types[column] = 'DECIMAL(10, 2)'
            except ValueError:
                pass
    
    sql_create_table = f"CREATE TABLE IF NOT EXISTS {table_name} (\n"
    for column, data_type in column_types.items():
        sql_create_table += f"    {column} {data_type},\n"
    sql_create_table = sql_create_table.rstrip(',\n')
    sql_create_table += "\n);\n"
    
    return sql_create_table

# Fungsi untuk membaca data dari file CSV dan menghasilkan pernyataan SQL INSERT satu per satu
def generate_sql_insert_from_csv(csv_file):
    table_name = os.path.splitext(os.path.basename(csv_file))[0]
    
    with open(csv_file, 'r', newline='', encoding='utf-8') as file:
        reader = csv.DictReader(file)
        rows = [row for row in reader]
    
    sql_inserts = []
    for row in rows:
        columns = ', '.join(row.keys())
        values = ', '.join([f"'{value}'" for value in row.values()])
        sql_insert = f"INSERT INTO {table_name} ({columns}) VALUES ({values});"
        sql_inserts.append(sql_insert)
    
    return sql_inserts

# Fungsi untuk menulis pernyataan SQL ke file
def write_sql_to_file(sql_queries, output_file):
    with open(output_file, 'w') as file:
        for sql_query in sql_queries:
            file.write(sql_query + '\n')

# Fungsi untuk menjalankan pernyataan SQL
def execute_sql_statements(sql_statements, connection):
    try:
        cursor = connection.cursor()
        for sql in sql_statements:
            try:
                cursor.execute(sql)
                connection.commit()
            except Exception as e:
                print(f"Error executing query: {sql}")
                print(e)
                connection.rollback()
    except Exception as e:
        print(f"Error: {e}")
    finally:
        cursor.close()

# Folder tempat file CSV disimpan
csv_folder = 'csv'

# Koneksi ke database
connection = psycopg2.connect(
    database="db_dskola",
    user="postgres",
    password="12345678",
    host="localhost",
    port="5434"
)

# Membuat pernyataan SQL CREATE TABLE dan INSERT dari setiap file CSV di dalam folder
sql_create_queries = []
sql_insert_queries = []
for file_name in os.listdir(csv_folder):
    if file_name.endswith('.csv'):
        file_path = os.path.join(csv_folder, file_name)
        sql_create_queries.append(generate_sql_create_table(file_path))
        sql_insert_queries.extend(generate_sql_insert_from_csv(file_path))

# Menulis pernyataan SQL CREATE TABLE ke file
output_create_file = 'create_tables.sql'
write_sql_to_file(sql_create_queries, output_create_file)
print(f"Pernyataan SQL CREATE TABLE telah ditulis ke '{output_create_file}'.")

# Menjalankan pernyataan SQL CREATE TABLE
execute_sql_statements(sql_create_queries, connection)

# Menjalankan pernyataan SQL INSERT satu per satu
execute_sql_statements(sql_insert_queries, connection)

# Menutup koneksi
connection.close()

Pernyataan SQL CREATE TABLE telah ditulis ke 'create_tables.sql'.
Error executing query: INSERT INTO categories (categoryID, categoryName, description, picture) VALUES ('1', 'Beverages', 'Soft drinks coffees teas beers and ales', '0x151C2F00020000000D000E0014002100FFFFFFFF4269746D617020496D616765005061696E742E5069637475726500010500000200000007000000504272757368000000000000000000A0290000424D98290000000000005600000028000000AC00000078000000010004000000000000000000880B0000880B0000080000');
value too long for type character varying(255)

Error executing query: INSERT INTO categories (categoryID, categoryName, description, picture) VALUES ('2', 'Condiments', 'Sweet and savory sauces relishes spreads and seasonings', '0x151C2F00020000000D000E0014002100FFFFFFFF4269746D617020496D616765005061696E742E5069637475726500010500000200000007000000504272757368000000000000000000A0290000424D98290000000000005600000028000000AC00000078000000010004000000000000000000880B0000880B0000080000');
value too long for type character varying(255)

Error executing query: INSERT INTO categories (categoryID, categoryName, description, picture) VALUES ('3', 'Confections', 'Desserts candies and sweet breads', '0x151C2F00020000000D000E0014002100FFFFFFFF4269746D617020496D616765005061696E742E5069637475726500010500000200000007000000504272757368000000000000000000A0290000424D98290000000000005600000028000000AC00000078000000010004000000000000000000880B0000880B0000080000');
value too long for type character varying(255)

Error executing query: INSERT INTO categories (categoryID, categoryName, description, picture) VALUES ('4', 'Dairy Products', 'Cheeses', '0x151C2F00020000000D000E0014002100FFFFFFFF4269746D617020496D616765005061696E742E5069637475726500010500000200000007000000504272757368000000000000000000A0290000424D98290000000000005600000028000000AC00000078000000010004000000000000000000880B0000880B0000080000');
value too long for type character varying(255)

Error executing query: INSERT INTO categories (categoryID, categoryName, description, picture) VALUES ('5', 'Grains/Cereals', 'Breads crackers pasta and cereal', '0x151C2F00020000000D000E0014002100FFFFFFFF4269746D617020496D616765005061696E742E5069637475726500010500000200000007000000504272757368000000000000000000A0290000424D98290000000000005600000028000000AC00000078000000010004000000000000000000880B0000880B0000080000');
value too long for type character varying(255)

Error executing query: INSERT INTO categories (categoryID, categoryName, description, picture) VALUES ('6', 'Meat/Poultry', 'Prepared meats', '0x151C2F00020000000D000E0014002100FFFFFFFF4269746D617020496D616765005061696E742E5069637475726500010500000200000007000000504272757368000000000000000000A0290000424D98290000000000005600000028000000AC00000078000000010004000000000000000000880B0000880B0000080000');
value too long for type character varying(255)

Error executing query: INSERT INTO categories (categoryID, categoryName, description, picture) VALUES ('7', 'Produce', 'Dried fruit and bean curd', '0x151C2F00020000000D000E0014002100FFFFFFFF4269746D617020496D616765005061696E742E5069637475726500010500000200000007000000504272757368000000000000000000A0290000424D98290000000000005600000028000000AC00000078000000010004000000000000000000880B0000880B0000080000');
value too long for type character varying(255)

Error executing query: INSERT INTO categories (categoryID, categoryName, description, picture) VALUES ('8', 'Seafood', 'Seaweed and fish', '0x151C2F00020000000D000E0014002100FFFFFFFF4269746D617020496D616765005061696E742E5069637475726500010500000200000007000000504272757368000000000000000000A0290000424D98290000000000005600000028000000AC00000078000000010004000000000000000000880B0000880B0000080000');
value too long for type character varying(255)

Error executing query: INSERT INTO customers (customerID, companyName, contactName, contactTitle, address, city, region, postalCode, country, phone, fax) VALUES ('AROUT', 'Around the Horn', 'Thomas Hardy', 'Sales Representative', '120 Hanover Sq.', 'London', 'NULL', 'WA1 1DP', 'UK', '(171) 555-7788', '(171) 555-6750');
invalid input syntax for type integer: "WA1 1DP"
LINE 1: ...esentative', '120 Hanover Sq.', 'London', 'NULL', 'WA1 1DP',...
                                                             ^

Error executing query: INSERT INTO customers (customerID, companyName, contactName, contactTitle, address, city, region, postalCode, country, phone, fax) VALUES ('BERGS', 'Berglunds snabbköp', 'Christina Berglund', 'Order Administrator', 'Berguvsvägen  8', 'Luleå', 'NULL', 'S-958 22', 'Sweden', '0921-12 34 65', '0921-12 34 67');
invalid input syntax for type integer: "S-958 22"
LINE 1: ...ministrator', 'Berguvsvägen  8', 'Luleå', 'NULL', 'S-958 22'...
                                                             ^

Error executing query: INSERT INTO customers (customerID, companyName, contactName, contactTitle, address, city, region, postalCode, country, phone, fax) VALUES ('BONAP', 'Bon app'', 'Laurence Lebihan', 'Owner', '12 rue des Bouchers', 'Marseille', 'NULL', '13008', 'France', '91.24.45.40', '91.24.45.41');
syntax error at or near "Laurence"
LINE 1: ...ountry, phone, fax) VALUES ('BONAP', 'Bon app'', 'Laurence L...
                                                             ^

Error executing query: INSERT INTO customers (customerID, companyName, contactName, contactTitle, address, city, region, postalCode, country, phone, fax) VALUES ('BOTTM', 'Bottom-Dollar Markets', 'Elizabeth Lincoln', 'Accounting Manager', '23 Tsawassen Blvd.', 'Tsawassen', 'BC', 'T2F 8M4', 'Canada', '(604) 555-4729', '(604) 555-3745');
invalid input syntax for type integer: "T2F 8M4"
LINE 1: ...anager', '23 Tsawassen Blvd.', 'Tsawassen', 'BC', 'T2F 8M4',...
                                                             ^

Error executing query: INSERT INTO customers (customerID, companyName, contactName, contactTitle, address, city, region, postalCode, country, phone, fax) VALUES ('BSBEV', 'B's Beverages', 'Victoria Ashworth', 'Sales Representative', 'Fauntleroy Circus', 'London', 'NULL', 'EC2 5NT', 'UK', '(171) 555-1212', 'NULL');
syntax error at or near "s"
LINE 1: ...talCode, country, phone, fax) VALUES ('BSBEV', 'B's Beverage...
                                                             ^

Error executing query: INSERT INTO customers (customerID, companyName, contactName, contactTitle, address, city, region, postalCode, country, phone, fax) VALUES ('COMMI', 'Comércio Mineiro', 'Pedro Afonso', 'Sales Associate', '23 Av. dos Lusíadas', 'Sao Paulo', 'SP', '05432-043', 'Brazil', '(11) 555-7647', 'NULL');
invalid input syntax for type integer: "05432-043"
LINE 1: ...ciate', '23 Av. dos Lusíadas', 'Sao Paulo', 'SP', '05432-043...
                                                             ^

Error executing query: INSERT INTO customers (customerID, companyName, contactName, contactTitle, address, city, region, postalCode, country, phone, fax) VALUES ('CONSH', 'Consolidated Holdings', 'Elizabeth Brown', 'Sales Representative', 'Berkeley Gardens 12  Brewery', 'London', 'NULL', 'WX1 6LT', 'UK', '(171) 555-2282', '(171) 555-9199');
invalid input syntax for type integer: "WX1 6LT"
LINE 1: ...'Berkeley Gardens 12  Brewery', 'London', 'NULL', 'WX1 6LT',...
                                                             ^

Error executing query: INSERT INTO customers (customerID, companyName, contactName, contactTitle, address, city, region, postalCode, country, phone, fax) VALUES ('EASTC', 'Eastern Connection', 'Ann Devon', 'Sales Agent', '35 King George', 'London', 'NULL', 'WX3 6FW', 'UK', '(171) 555-0297', '(171) 555-3373');
invalid input syntax for type integer: "WX3 6FW"
LINE 1: ...Sales Agent', '35 King George', 'London', 'NULL', 'WX3 6FW',...
                                                             ^

Error executing query: INSERT INTO customers (customerID, companyName, contactName, contactTitle, address, city, region, postalCode, country, phone, fax) VALUES ('FAMIA', 'Familia Arquibaldo', 'Aria Cruz', 'Marketing Assistant', 'Rua Orós 92', 'Sao Paulo', 'SP', '05442-030', 'Brazil', '(11) 555-9857', 'NULL');
invalid input syntax for type integer: "05442-030"
LINE 1: ...ing Assistant', 'Rua Orós 92', 'Sao Paulo', 'SP', '05442-030...
                                                             ^

Error executing query: INSERT INTO customers (customerID, companyName, contactName, contactTitle, address, city, region, postalCode, country, phone, fax) VALUES ('FOLKO', 'Folk och fä HB', 'Maria Larsson', 'Owner', 'Åkergatan 24', 'Bräcke', 'NULL', 'S-844 67', 'Sweden', '0695-34 67 21', 'NULL');
invalid input syntax for type integer: "S-844 67"
LINE 1: ...sson', 'Owner', 'Åkergatan 24', 'Bräcke', 'NULL', 'S-844 67'...
                                                             ^

Error executing query: INSERT INTO customers (customerID, companyName, contactName, contactTitle, address, city, region, postalCode, country, phone, fax) VALUES ('GOURL', 'Gourmet Lanchonetes', 'André Fonseca', 'Sales Associate', 'Av. Brasil 442', 'Campinas', 'SP', '04876-786', 'Brazil', '(11) 555-9482', 'NULL');
invalid input syntax for type integer: "04876-786"
LINE 1: ...s Associate', 'Av. Brasil 442', 'Campinas', 'SP', '04876-786...
                                                             ^

Error executing query: INSERT INTO customers (customerID, companyName, contactName, contactTitle, address, city, region, postalCode, country, phone, fax) VALUES ('HANAR', 'Hanari Carnes', 'Mario Pontes', 'Accounting Manager', 'Rua do Paço 67', 'Rio de Janeiro', 'RJ', '05454-876', 'Brazil', '(21) 555-0091', '(21) 555-8765');
invalid input syntax for type integer: "05454-876"
LINE 1: ...nager', 'Rua do Paço 67', 'Rio de Janeiro', 'RJ', '05454-876...
                                                             ^

Error executing query: INSERT INTO customers (customerID, companyName, contactName, contactTitle, address, city, region, postalCode, country, phone, fax) VALUES ('HUNGO', 'Hungry Owl All-Night Grocers', 'Patricia McKenna', 'Sales Associate', '8 Johnstown Road', 'Cork', 'Co. Cork', 'NULL', 'Ireland', '2967 542', '2967 3333');
invalid input syntax for type integer: "NULL"
LINE 1: ...sociate', '8 Johnstown Road', 'Cork', 'Co. Cork', 'NULL', 'I...
                                                             ^

Error executing query: INSERT INTO customers (customerID, companyName, contactName, contactTitle, address, city, region, postalCode, country, phone, fax) VALUES ('ISLAT', 'Island Trading', 'Helen Bennett', 'Marketing Manager', 'Garden House Crowther Way', 'Cowes', 'Isle of Wight', 'PO31 7PJ', 'UK', '(198) 555-8888', 'NULL');
invalid input syntax for type integer: "PO31 7PJ"
LINE 1: ...en House Crowther Way', 'Cowes', 'Isle of Wight', 'PO31 7PJ'...
                                                             ^

Error executing query: INSERT INTO customers (customerID, companyName, contactName, contactTitle, address, city, region, postalCode, country, phone, fax) VALUES ('LACOR', 'La corne d'abondance', 'Daniel Tonini', 'Sales Representative', '67 avenue de l'Europe', 'Versailles', 'NULL', '78000', 'France', '30.59.84.10', '30.59.85.11');
syntax error at or near "abondance"
LINE 1: ...country, phone, fax) VALUES ('LACOR', 'La corne d'abondance'...
                                                             ^

Error executing query: INSERT INTO customers (customerID, companyName, contactName, contactTitle, address, city, region, postalCode, country, phone, fax) VALUES ('LAMAI', 'La maison d'Asie', 'Annette Roulet', 'Sales Manager', '1 rue Alsace-Lorraine', 'Toulouse', 'NULL', '31000', 'France', '61.77.61.10', '61.77.61.11');
syntax error at or near "Asie"
LINE 1: ...ountry, phone, fax) VALUES ('LAMAI', 'La maison d'Asie', 'An...
                                                             ^

Error executing query: INSERT INTO customers (customerID, companyName, contactName, contactTitle, address, city, region, postalCode, country, phone, fax) VALUES ('LAUGB', 'Laughing Bacchus Wine Cellars', 'Yoshi Tannamuri', 'Marketing Assistant', '1900 Oak St.', 'Vancouver', 'BC', 'V3F 2K1', 'Canada', '(604) 555-3392', '(604) 555-7293');
invalid input syntax for type integer: "V3F 2K1"
LINE 1: ...ng Assistant', '1900 Oak St.', 'Vancouver', 'BC', 'V3F 2K1',...
                                                             ^

Error executing query: INSERT INTO customers (customerID, companyName, contactName, contactTitle, address, city, region, postalCode, country, phone, fax) VALUES ('LETSS', 'Let's Stop N Shop', 'Jaime Yorres', 'Owner', '87 Polk St. Suite 5', 'San Francisco', 'CA', '94117', 'USA', '(415) 555-5938', 'NULL');
syntax error at or near "s"
LINE 1: ...lCode, country, phone, fax) VALUES ('LETSS', 'Let's Stop N S...
                                                             ^

Error executing query: INSERT INTO customers (customerID, companyName, contactName, contactTitle, address, city, region, postalCode, country, phone, fax) VALUES ('MAISD', 'Maison Dewey', 'Catherine Dewey', 'Sales Agent', 'Rue Joseph-Bens 532', 'Bruxelles', 'NULL', 'B-1180', 'Belgium', '(02) 201 24 67', '(02) 201 24 68');
invalid input syntax for type integer: "B-1180"
LINE 1: ...ent', 'Rue Joseph-Bens 532', 'Bruxelles', 'NULL', 'B-1180', ...
                                                             ^

Error executing query: INSERT INTO customers (customerID, companyName, contactName, contactTitle, address, city, region, postalCode, country, phone, fax) VALUES ('MEREP', 'Mère Paillarde', 'Jean Fresnière', 'Marketing Assistant', '43 rue St. Laurent', 'Montréal', 'Québec', 'H1J 1C3', 'Canada', '(514) 555-8054', '(514) 555-8055');
invalid input syntax for type integer: "H1J 1C3"
LINE 1: ...ant', '43 rue St. Laurent', 'Montréal', 'Québec', 'H1J 1C3',...
                                                             ^

Error executing query: INSERT INTO customers (customerID, companyName, contactName, contactTitle, address, city, region, postalCode, country, phone, fax) VALUES ('NORTS', 'North/South', 'Simon Crowther', 'Sales Associate', 'South House 300 Queensbridge', 'London', 'NULL', 'SW7 1RZ', 'UK', '(171) 555-7733', '(171) 555-2530');
invalid input syntax for type integer: "SW7 1RZ"
LINE 1: ...'South House 300 Queensbridge', 'London', 'NULL', 'SW7 1RZ',...
                                                             ^

Error executing query: INSERT INTO customers (customerID, companyName, contactName, contactTitle, address, city, region, postalCode, country, phone, fax) VALUES ('QUEDE', 'Que Delícia', 'Bernardo Batista', 'Accounting Manager', 'Rua da Panificadora', ' 12Rio de Janeiro', 'RJ', '02389-673', 'Brazil', '(21) 555-4252', '(21) 555-4545');
invalid input syntax for type integer: "02389-673"
LINE 1: ...'Rua da Panificadora', ' 12Rio de Janeiro', 'RJ', '02389-673...
                                                             ^

Error executing query: INSERT INTO customers (customerID, companyName, contactName, contactTitle, address, city, region, postalCode, country, phone, fax) VALUES ('QUEEN', 'Queen Cozinha', 'Lúcia Carvalho', 'Marketing Assistant', 'Alameda dos Canàrios 891', 'Sao Paulo', 'SP', '05487-020', 'Brazil', '(11) 555-1189', 'NULL');
invalid input syntax for type integer: "05487-020"
LINE 1: ...', 'Alameda dos Canàrios 891', 'Sao Paulo', 'SP', '05487-020...
                                                             ^

Error executing query: INSERT INTO customers (customerID, companyName, contactName, contactTitle, address, city, region, postalCode, country, phone, fax) VALUES ('RICAR', 'Ricardo Adocicados', 'Janete Limeira', 'Assistant Sales Agent', 'Av. Copacabana 267', 'Rio de Janeiro', 'RJ', '02389-890', 'Brazil', '(21) 555-3412', 'NULL');
invalid input syntax for type integer: "02389-890"
LINE 1: ...t', 'Av. Copacabana 267', 'Rio de Janeiro', 'RJ', '02389-890...
                                                             ^

Error executing query: INSERT INTO customers (customerID, companyName, contactName, contactTitle, address, city, region, postalCode, country, phone, fax) VALUES ('SEVES', 'Seven Seas Imports', 'Hari Kumar', 'Sales Manager', '90 Wadhurst Rd.', 'London', 'NULL', 'OX15 4NB', 'UK', '(171) 555-1717', '(171) 555-5646');
invalid input syntax for type integer: "OX15 4NB"
LINE 1: ...es Manager', '90 Wadhurst Rd.', 'London', 'NULL', 'OX15 4NB'...
                                                             ^

Error executing query: INSERT INTO customers (customerID, companyName, contactName, contactTitle, address, city, region, postalCode, country, phone, fax) VALUES ('SUPRD', 'Suprêmes délices', 'Pascale Cartrain', 'Accounting Manager', 'Boulevard Tirou 255', 'Charleroi', 'NULL', 'B-6000', 'Belgium', '(071) 23 67 22 20', '(071) 23 67 22 21');
invalid input syntax for type integer: "B-6000"
LINE 1: ...ger', 'Boulevard Tirou 255', 'Charleroi', 'NULL', 'B-6000', ...
                                                             ^

Error executing query: INSERT INTO customers (customerID, companyName, contactName, contactTitle, address, city, region, postalCode, country, phone, fax) VALUES ('TRADH', 'Tradição Hipermercados', 'Anabela Domingues', 'Sales Representative', 'Av. Inês de Castro 414', 'Sao Paulo', 'SP', '05634-030', 'Brazil', '(11) 555-2167', '(11) 555-2168');
invalid input syntax for type integer: "05634-030"
LINE 1: ...ve', 'Av. Inês de Castro 414', 'Sao Paulo', 'SP', '05634-030...
                                                             ^

Error executing query: INSERT INTO customers (customerID, companyName, contactName, contactTitle, address, city, region, postalCode, country, phone, fax) VALUES ('TRAIH', 'Trail's Head Gourmet Provisioners', 'Helvetius Nagy', 'Sales Associate', '722 DaVinci Blvd.', 'Kirkland', 'WA', '98034', 'USA', '(206) 555-8257', '(206) 555-2174');
syntax error at or near "s"
LINE 1: ...ode, country, phone, fax) VALUES ('TRAIH', 'Trail's Head Gou...
                                                             ^

Error executing query: INSERT INTO customers (customerID, companyName, contactName, contactTitle, address, city, region, postalCode, country, phone, fax) VALUES ('VINET', 'Vins et alcools Chevalier', 'Paul Henriot', 'Accounting Manager', '59 rue de l'Abbaye', 'Reims', 'NULL', '51100', 'France', '26.47.15.10', '26.47.15.11');
syntax error at or near "Abbaye"
LINE 1: ...Paul Henriot', 'Accounting Manager', '59 rue de l'Abbaye', '...
                                                             ^

Error executing query: INSERT INTO customers (customerID, companyName, contactName, contactTitle, address, city, region, postalCode, country, phone, fax) VALUES ('WELLI', 'Wellington Importadora', 'Paula Parente', 'Sales Manager', 'Rua do Mercado 12', 'Resende', 'SP', '08737-363', 'Brazil', '(14) 555-8122', 'NULL');
invalid input syntax for type integer: "08737-363"
LINE 1: ...s Manager', 'Rua do Mercado 12', 'Resende', 'SP', '08737-363...
                                                             ^

Error executing query: INSERT INTO customers (customerID, companyName, contactName, contactTitle, address, city, region, postalCode, country, phone, fax) VALUES ('WOLZA', 'Wolski  Zajazd', 'Zbyszek Piestrzeniewicz', 'Owner', 'ul. Filtrowa 68', 'Warszawa', 'NULL', '01-012', 'Poland', '(26) 642-7012', '(26) 642-7012');
invalid input syntax for type integer: "01-012"
LINE 1: ..., 'Owner', 'ul. Filtrowa 68', 'Warszawa', 'NULL', '01-012', ...
                                                             ^


In [1]:
import pandas as pd
from sqlalchemy import create_engine
import os

# Informasi koneksi PostgreSQL
db_user = 'postgres'
db_password = '12345678'
db_host = 'localhost'
db_port = '5434'
db_name = 'db_dskola'

# Membuat engine untuk koneksi ke PostgreSQL
engine = create_engine(f'postgresql+psycopg2://{db_user}:{db_password}@{db_host}:{db_port}/{db_name}')

# Path ke folder yang berisi file CSV
csv_folder = 'csv'

# Loop melalui setiap file dalam folder CSV
for filename in os.listdir(csv_folder):
    if filename.endswith('.csv'):
        # Path lengkap ke file CSV
        csv_file = os.path.join(csv_folder, filename)
        
        # Baca data dari file CSV
        df = pd.read_csv(csv_file)
        
        # Nama tabel, di sini kita menggunakan nama file (tanpa ekstensi) sebagai nama tabel
        table_name = os.path.splitext(filename)[0]
        
        # Memasukkan data ke dalam tabel di PostgreSQL
        df.to_sql(table_name, engine, if_exists='replace', index=False)
        
        print(f"Data dari {filename} berhasil dimuat ke PostgreSQL sebagai tabel {table_name}!")

print("Semua data berhasil dimuat ke PostgreSQL!")

Data dari categories.csv berhasil dimuat ke PostgreSQL sebagai tabel categories!
Data dari customers.csv berhasil dimuat ke PostgreSQL sebagai tabel customers!
Data dari employees.csv berhasil dimuat ke PostgreSQL sebagai tabel employees!
Data dari employee_territories.csv berhasil dimuat ke PostgreSQL sebagai tabel employee_territories!
Data dari orders.csv berhasil dimuat ke PostgreSQL sebagai tabel orders!
Data dari order_details.csv berhasil dimuat ke PostgreSQL sebagai tabel order_details!
Data dari products.csv berhasil dimuat ke PostgreSQL sebagai tabel products!
Data dari regions.csv berhasil dimuat ke PostgreSQL sebagai tabel regions!
Data dari shippers.csv berhasil dimuat ke PostgreSQL sebagai tabel shippers!
Data dari suppliers.csv berhasil dimuat ke PostgreSQL sebagai tabel suppliers!
Data dari territories.csv berhasil dimuat ke PostgreSQL sebagai tabel territories!
Semua data berhasil dimuat ke PostgreSQL!

In [17]:
pip install sqlalchemy

Collecting sqlalchemy
  Downloading SQLAlchemy-2.0.30-cp311-cp311-win_amd64.whl.metadata (9.8 kB)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\hello\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (from sqlalchemy) (4.12.1)
Collecting greenlet!=0.4.17 (from sqlalchemy)
  Downloading greenlet-3.0.3-cp311-cp311-win_amd64.whl.metadata (3.9 kB)
Downloading SQLAlchemy-2.0.30-cp311-cp311-win_amd64.whl (2.1 MB)
   ---------------------------------------- 0.0/2.1 MB ? eta -:--:--
   ---------------------------------------- 0.0/2.1 MB ? eta -:--:--
    --------------------------------------- 0.0/2.1 MB 330.3 kB/s eta 0:00:07
   - -------------------------------------- 0.1/2.1 MB 409.6 kB/s eta 0:00:05
   - -------------------------------------- 0.1/2.1 MB 476.3 kB/s eta 0:00:05
   -- ------------------------------------- 0.1/2.1 MB 516.7 kB/s eta 0:00:04
   -- ------------------------------------- 0.2/2.1 MB 541.0 kB/s eta 0:00:04
   --- ------------------------------------ 0.2/2.1 MB 557.9 kB/s eta 0:00:04
   --- ------------------------------------ 0.2/2.1 MB 541.9 kB/s eta 0:00:04
   ---- ----------------------------------- 0.2/2.1 MB 533.8 kB/s eta 0:00:04
   ---- ----------------------------------- 0.3/2.1 MB 542.5 kB/s eta 0:00:04
   ----- ---------------------------------- 0.3/2.1 MB 536.9 kB/s eta 0:00:04
   ----- ---------------------------------- 0.3/2.1 MB 542.9 kB/s eta 0:00:04
   ------ --------------------------------- 0.3/2.1 MB 518.0 kB/s eta 0:00:04
   ------ --------------------------------- 0.3/2.1 MB 524.3 kB/s eta 0:00:04
   ------- -------------------------------- 0.4/2.1 MB 509.8 kB/s eta 0:00:04
   ------- -------------------------------- 0.4/2.1 MB 530.1 kB/s eta 0:00:04
   -------- ------------------------------- 0.4/2.1 MB 539.6 kB/s eta 0:00:04
   -------- ------------------------------- 0.5/2.1 MB 522.3 kB/s eta 0:00:04
   --------- ------------------------------ 0.5/2.1 MB 526.6 kB/s eta 0:00:04
   --------- ------------------------------ 0.5/2.1 MB 515.8 kB/s eta 0:00:04
   --------- ------------------------------ 0.5/2.1 MB 515.8 kB/s eta 0:00:04
   ---------- ----------------------------- 0.5/2.1 MB 498.8 kB/s eta 0:00:04
   ---------- ----------------------------- 0.6/2.1 MB 503.4 kB/s eta 0:00:04
   ----------- ---------------------------- 0.6/2.1 MB 503.0 kB/s eta 0:00:03
   ----------- ---------------------------- 0.6/2.1 MB 506.8 kB/s eta 0:00:03
   ------------ --------------------------- 0.6/2.1 MB 506.2 kB/s eta 0:00:03
   ------------ --------------------------- 0.7/2.1 MB 511.6 kB/s eta 0:00:03
   ------------- -------------------------- 0.7/2.1 MB 515.1 kB/s eta 0:00:03
   ------------- -------------------------- 0.7/2.1 MB 508.3 kB/s eta 0:00:03
   ------------- -------------------------- 0.7/2.1 MB 504.1 kB/s eta 0:00:03
   -------------- ------------------------- 0.8/2.1 MB 510.6 kB/s eta 0:00:03
   -------------- ------------------------- 0.8/2.1 MB 506.9 kB/s eta 0:00:03
   --------------- ------------------------ 0.8/2.1 MB 509.7 kB/s eta 0:00:03
   --------------- ------------------------ 0.8/2.1 MB 501.4 kB/s eta 0:00:03
   --------------- ------------------------ 0.8/2.1 MB 499.5 kB/s eta 0:00:03
   ---------------- ----------------------- 0.9/2.1 MB 506.6 kB/s eta 0:00:03
   ----------------- ---------------------- 0.9/2.1 MB 507.9 kB/s eta 0:00:03
   ----------------- ---------------------- 0.9/2.1 MB 508.6 kB/s eta 0:00:03
   ------------------ --------------------- 1.0/2.1 MB 512.3 kB/s eta 0:00:03
   ------------------- -------------------- 1.0/2.1 MB 520.1 kB/s eta 0:00:03
   -------------------- ------------------- 1.0/2.1 MB 533.9 kB/s eta 0:00:02
   -------------------- ------------------- 1.1/2.1 MB 531.6 kB/s eta 0:00:02
   --------------------- ------------------ 1.1/2.1 MB 534.4 kB/s eta 0:00:02
   --------------------- ------------------ 1.1/2.1 MB 533.3 kB/s eta 0:00:02
   ---------------------- ----------------- 1.1/2.1 MB 534.9 kB/s eta 0:00:02
   ---------------------- ----------------- 1.2/2.1 MB 541.4 kB/s eta 0:00:02
   ----------------------- ---------------- 1.2/2.1 MB 549.4 kB/s eta 0:00:02
   ------------------------ --------------- 1.3/2.1 MB 555.2 kB/s eta 0:00:02
   ------------------------ --------------- 1.3/2.1 MB 553.6 kB/s eta 0:00:02
   ------------------------- -------------- 1.3/2.1 MB 551.3 kB/s eta 0:00:02
   ------------------------- -------------- 1.3/2.1 MB 548.4 kB/s eta 0:00:02
   -------------------------- ------------- 1.4/2.1 MB 550.4 kB/s eta 0:00:02
   -------------------------- ------------- 1.4/2.1 MB 556.5 kB/s eta 0:00:02
   -------------------------- ------------- 1.4/2.1 MB 556.5 kB/s eta 0:00:02
   --------------------------- ------------ 1.4/2.1 MB 552.1 kB/s eta 0:00:02
   ---------------------------- ----------- 1.5/2.1 MB 557.8 kB/s eta 0:00:02
   ---------------------------- ----------- 1.5/2.1 MB 557.8 kB/s eta 0:00:02
   ---------------------------- ----------- 1.5/2.1 MB 545.5 kB/s eta 0:00:02
   ----------------------------- ---------- 1.5/2.1 MB 547.4 kB/s eta 0:00:02
   ----------------------------- ---------- 1.5/2.1 MB 539.5 kB/s eta 0:00:02
   ------------------------------ --------- 1.6/2.1 MB 541.4 kB/s eta 0:00:01
   ------------------------------ --------- 1.6/2.1 MB 542.7 kB/s eta 0:00:01
   ------------------------------ --------- 1.6/2.1 MB 540.4 kB/s eta 0:00:01
   ------------------------------ --------- 1.6/2.1 MB 540.4 kB/s eta 0:00:01
   ------------------------------- -------- 1.6/2.1 MB 527.6 kB/s eta 0:00:01
   ------------------------------- -------- 1.6/2.1 MB 527.6 kB/s eta 0:00:01
   ------------------------------- -------- 1.6/2.1 MB 527.6 kB/s eta 0:00:01
   ------------------------------- -------- 1.6/2.1 MB 527.6 kB/s eta 0:00:01
   ------------------------------- -------- 1.6/2.1 MB 527.6 kB/s eta 0:00:01
   ------------------------------- -------- 1.6/2.1 MB 527.6 kB/s eta 0:00:01
   -------------------------------- ------- 1.7/2.1 MB 499.3 kB/s eta 0:00:01
   -------------------------------- ------- 1.7/2.1 MB 499.3 kB/s eta 0:00:01
   --------------------------------- ------ 1.7/2.1 MB 497.6 kB/s eta 0:00:01
   --------------------------------- ------ 1.8/2.1 MB 499.7 kB/s eta 0:00:01
   ---------------------------------- ----- 1.8/2.1 MB 501.7 kB/s eta 0:00:01
   ---------------------------------- ----- 1.8/2.1 MB 503.1 kB/s eta 0:00:01
   ---------------------------------- ----- 1.8/2.1 MB 499.4 kB/s eta 0:00:01
   ---------------------------------- ----- 1.8/2.1 MB 499.4 kB/s eta 0:00:01
   ----------------------------------- ---- 1.8/2.1 MB 496.4 kB/s eta 0:00:01
   ----------------------------------- ---- 1.8/2.1 MB 490.9 kB/s eta 0:00:01
   ----------------------------------- ---- 1.9/2.1 MB 490.2 kB/s eta 0:00:01
   ------------------------------------ --- 1.9/2.1 MB 491.6 kB/s eta 0:00:01
   ------------------------------------ --- 1.9/2.1 MB 490.3 kB/s eta 0:00:01
   ------------------------------------ --- 1.9/2.1 MB 487.6 kB/s eta 0:00:01
   ------------------------------------ --- 1.9/2.1 MB 487.6 kB/s eta 0:00:01
   ------------------------------------- -- 1.9/2.1 MB 480.6 kB/s eta 0:00:01
   ------------------------------------- -- 1.9/2.1 MB 480.6 kB/s eta 0:00:01
   ------------------------------------- -- 1.9/2.1 MB 480.6 kB/s eta 0:00:01
   ------------------------------------- -- 1.9/2.1 MB 480.6 kB/s eta 0:00:01
   ------------------------------------- -- 1.9/2.1 MB 480.6 kB/s eta 0:00:01
   ------------------------------------- -- 1.9/2.1 MB 480.6 kB/s eta 0:00:01
   ------------------------------------- -- 1.9/2.1 MB 480.6 kB/s eta 0:00:01
   ------------------------------------- -- 1.9/2.1 MB 480.6 kB/s eta 0:00:01
   ------------------------------------- -- 2.0/2.1 MB 447.0 kB/s eta 0:00:01
   ---------------------------------------  2.0/2.1 MB 456.2 kB/s eta 0:00:01
   ---------------------------------------  2.0/2.1 MB 456.2 kB/s eta 0:00:01
   ---------------------------------------  2.0/2.1 MB 456.2 kB/s eta 0:00:01
   ---------------------------------------  2.0/2.1 MB 456.2 kB/s eta 0:00:01
   ---------------------------------------- 2.1/2.1 MB 450.2 kB/s eta 0:00:00
Downloading greenlet-3.0.3-cp311-cp311-win_amd64.whl (292 kB)
   ---------------------------------------- 0.0/292.8 kB ? eta -:--:--
   ---------------------------------------- 0.0/292.8 kB ? eta -:--:--
   - -------------------------------------- 10.2/292.8 kB ? eta -:--:--
   ----- --------------------------------- 41.0/292.8 kB 326.8 kB/s eta 0:00:01
   -------- ------------------------------ 61.4/292.8 kB 363.1 kB/s eta 0:00:01
   --------- ----------------------------- 71.7/292.8 kB 357.2 kB/s eta 0:00:01
   ------------ -------------------------- 92.2/292.8 kB 403.5 kB/s eta 0:00:01
   -------------- ----------------------- 112.6/292.8 kB 385.0 kB/s eta 0:00:01
   --------------- ---------------------- 122.9/292.8 kB 379.3 kB/s eta 0:00:01
   ------------------ ------------------- 143.4/292.8 kB 369.8 kB/s eta 0:00:01
   ------------------ ------------------- 143.4/292.8 kB 369.8 kB/s eta 0:00:01
   ------------------- ------------------ 153.6/292.8 kB 316.5 kB/s eta 0:00:01
   ------------------- ------------------ 153.6/292.8 kB 316.5 kB/s eta 0:00:01
   ------------------------- ------------ 194.6/292.8 kB 318.9 kB/s eta 0:00:01
   ------------------------- ------------ 194.6/292.8 kB 318.9 kB/s eta 0:00:01
   -------------------------- ----------- 204.8/292.8 kB 303.5 kB/s eta 0:00:01
   -------------------------- ----------- 204.8/292.8 kB 303.5 kB/s eta 0:00:01
   ----------------------------- -------- 225.3/292.8 kB 292.6 kB/s eta 0:00:01
   ------------------------------ ------- 235.5/292.8 kB 288.4 kB/s eta 0:00:01
   --------------------------------- ---- 256.0/292.8 kB 296.8 kB/s eta 0:00:01
   --------------------------------- ---- 256.0/292.8 kB 296.8 kB/s eta 0:00:01
   ----------------------------------- -- 276.5/292.8 kB 279.4 kB/s eta 0:00:01
   -------------------------------------  286.7/292.8 kB 276.5 kB/s eta 0:00:01
   -------------------------------------- 292.8/292.8 kB 278.1 kB/s eta 0:00:00
Installing collected packages: greenlet, sqlalchemy
Successfully installed greenlet-3.0.3 sqlalchemy-2.0.30
Note: you may need to restart the kernel to use updated packages.

  WARNING: Retrying (Retry(total=4, connect=None, read=None, redirect=None, status=None)) after connection broken by 'ConnectTimeoutError(<pip._vendor.urllib3.connection.HTTPSConnection object at 0x000001E11F831AD0>, 'Connection to files.pythonhosted.org timed out. (connect timeout=15)')': /packages/74/9a/eec023807ae78e83342567303916b34a348d9d40703e7cef5dfb1e3635b6/SQLAlchemy-2.0.30-cp311-cp311-win_amd64.whl.metadata